pkg/fixtures/triggers/payment_intent.payment_failed.json

{
  "_meta": {
    "template_version": 0
  },
  "fixtures": [
    {
      "name": "payment_intent",
      "expected_error_type": "card_error",
      "path": "/v1/payment_intents",
      "method": "post",
      "params": {
        "amount": 2000,
        "confirm": "true",
        "currency": "usd",
        "description": "(created by Stripe CLI)",
        "payment_method": "pm_card_chargeDeclined",
        "payment_method_types": ["card"]
      }
    }
  ]
}
